In [2]:
import numpy as np
import pandas as pd

In [3]:
d = {'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]}

In [4]:
df = pd.DataFrame(d)

In [5]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

# dropna method

In [6]:
df.dropna() # pandas will drop row having NaN
            # default axios = 0 , i.e. row wise

     A    B  C
0  1.0  5.0  1

In [7]:
df.dropna(axis=1) # for column

   C
0  1
1  2
2  3

# using thresh
thresh used to defined number of NaN will be there then will not show that row or column

In [10]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [11]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

#  Filling Value for NaN

In [12]:
df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

# Filling the value of mean of column

In [13]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64